# 1)ჩამოწერეთ ყველა შედარების ოპერატორები რაც ისწავლეთ და ჩამოწერეთ რას აკეთებენ ისინი
# + მიმატება - გამოკლება * გამრავლება / გაყოფა //რამდენჯერ მოთავსდება რიცხვი მეორე რიცხვში

# 2)ჩამოწერეთ ყველა შესაძლო and/or კომბინაცია და გვერძე მიუწერეთ თუ რას დააბრუნებს
# a = 7<9
# b = 96>958
# c = 8484>3999
# print(a and b) #false
# print(b and c)#false
# print(a and c) #true

# print(a or b) #true
# print(b or c) #true
# print(a or c) #true



# 3)ცვლადში შეინახეთ თქვენი საყვარელი რიცხვი შემდეგ შემოატანინეთ მომმარებელს მისი საყვარელი რიცხვი და შემდეგ შეადარეთ უდრის თუ არა ისინი ერთმანეთს
fav_num = 14
num1 = int(input("please enter ur num: "))
print(fav_num == num1) #true