# 1) მომხმარებელს შემოატანინეთ სიტყვა. ტერმინალში კი დაბეჭდეთ ეს სიტყვა ისე რომ იყოს:

# 1. ყველა პატარა ასო;
# 2. ყველა დიდი ასო;
# 3. პირველი ასო დიდი, ხოლო ყველა დანარჩენი პატარა.


# word = input("enter a word: ")


# print("small letters:", word.lower())


# print("big letters:", word.upper())


# print("first big, all of it small:", word.capitalize())


# 2) მომხმარებელს შემოატანინეთ სამი წინადადება და თითოეულზე გამოიყენეთ სხვადასხვა სტრინგის მეთოდი:
# პირველ წინადადებაზე — .lower()
# მეორე წინადადებაზე — .upper()
# მესამე წინადადებაზე — .capitalize()

word1 = input("enter first sentence: ")

word2 = input("enter second sentence: ")

word3 = input("enter third sentence: ")

print("პირველი წინადადება (lower):", word1.lower())
print("მეორე წინადადება (upper):", word2.upper())
print("მესამე წინადადება (capitalize):", word3.capitalize())

# 3) ცვლადში შეინახე შენი სახელი. მომხმარებელს შეეკითხე თავისი სახელი, იმ შემთხვევაში თუ თქვენი სახელები ემთხვევა დაბეჭდეთ "Our names are similar!", თუ არ ემთხვევა დაბეჭდეთ "We have different names". გაითვალისწინეთ, რომ მომხმარებელმა შეიძლება თქვენნაირი სახელი შემოიტანოს, თუმცა სახელის ასოები შესაძლოა იყოს სხვადასხვა შრიფტის ზომით, ამიტომ ამან თქვენ პროგრამაში შეფერხება არ უნდა გამოიწვიოს (გამოიყენეთ ნასწავლი სტრინგის მეთოდები)


my_name = "elena"


user_name = input("შეიყვანეთ თქვენი სახელი: ")


if my_name.lower() == user_name.lower():
    print("Our names are similar!")
else:
    print("We have different names.")


# 4) ცვლადში შეინახე წინადადება, დაწერე ისეთი პროგრამა რომ მხოლოდ წინადადების პირველი სიტყვა იყოს დიდი ასოთი, დანარჩენი კი იყოს პატარა.


sentence = "ეს არის წინადადება"

formatted_sentence = sentence.capitalize()

print(formatted_sentence)


# 5) კომენტარის სახით ჩამოწერეთ ყველა სტრინგის მეთოდი, რომელიც ისწავლეთ. თითოეულს მიუწერეთ დეტალური განმარტება და მათზე მოიყვანეთ თითო-თითო მაგალითი.

# .lower() – გარდაქმნის მთელ სტრინგს პატარა ასოებად
# გამოყენება:
print("HELLO".lower())  # შედეგი: "hello"

# .upper() – გარდაქმნის მთელ სტრინგს დიდი ასოებად
# გამოყენება:
print("hello".upper())  # შედეგი: "HELLO"

# .capitalize() – მხოლოდ პირველი ასო გახდება დიდი, დანარჩენი პატარა
# გამოყენება:
print("gOOD DAY".capitalize())  # შედეგი: "Good day"

# .find() – აბრუნებს პირველი აღმოჩენილი სიმბოლოს ინდექსს (თუ არ არსებობს -1)
# გამოყენება:
print("banana".find("a"))  # შედეგი: 1
