
# 2)გამოიტანეთ ტერმინალში თქვენი სახელი და გვარი 100-ჯერ(გამოიყენეთ გამრავლება)
name="elena"
surname="afanasieva"
print((name + " " + " "+ surname + " ") * 100)

name1="tato"
surname2="afanasieva"
print((name1 + " " + surname2 + " " ) * 100)

# 3)კომენტარებით ახსენით რა არის კონკადინაცია. მოიყვანეთ მაგალითები
# კონკადინცია ეწოდება სტრინგების ერთმანეთთან დამატებას  მაგ:"ელენა"+"აფანასიევა" და კიდევ "ე"+"ლ"+"ე"+"ნ"+"ა"

# 4)გამოასწორეთ შემდეგი კოდი:
# city => "London':
# print"city)
city="London"
print(city)

# 5)შექმენით 3 ცვლადი, სადაც შეინახავთ თქვენი და ოჯახის წევრების ასაკს. გამოითვალეთ მათი საშუალო არითმეტიკული და დაბეჭდეთ ტერმინალში
mother="xatia"# cvladi aris mother
age1=52

me="elena" #cvadi aris me
age2=10

sister="tato" #cvladi aris sister
age3=14
print(age1 + age2 + age3 / 3) # საშუალო არითმეტიკული არის როდესაც ჩვენ ვიღებთ რაღაცა რიცხვებს ვიგებთ მათ ჯამს და შემდგომ ვყოფთ მათ რაოდენობაზე 


# 6)შექმენით 2 ცვლადი, სადაც შეინახავთ რიცხვებს. შემდეგ გაიგეთ ორივე რიცხვის კვადრატი და დაპრინტეთ მათი ჯამი
num1 = 23
num2 = 17
print(num1**2 + num2**2)

# 7)შექმენით ცვლადები, სადაც შეინახავთ 2 integer-ს. ჩაატარეთ ყველა მათემატიკური ოპერაცია ამ ორ ცვლადს შორის და დაბეჭდეთ პასუხი
num3 = 4
num4 = 7
print(num3 * num4)

# 8)ახსენით რა არის კომენტარი და რისთვის გამოიყენება
#კომენტარი არის იმისთვის რომ, თუ რამე დაგავიწყდა ჩაიხედავ უცებ და გაიხსენებ. 
