# 1)ახსენით რა არის iteration,sequencing,selection ასევე მოიყვანეთ რეალური მაგალითები ცხოვრებიდან თითოეულთან დაკავშირებით

#sequence - თანმიმდევრობა

# iteration - იტერაცია(გამეორება)

# selection - გადაწყვეტილება ან ქმედება რომელიც აირჩევა კონკრეტულ პირობაზე დაყრდნობით
 
 

# 2)შეურიეთ შედარების და ლოგიკური ოპერატორები და გააკეთეთ ისევ 10 მაგალითი

# 3)მომხმარებელს შემოატანინეთ მისი სახელი, შემოატანინეთ მისი ასაკი, ასევე სიმაღლე და შეამოწმეთ თუ მომხმარებლის ასაკი მეტია 18 და მისი სახელი უდრის თქვენს სახელს და ასევე მისი სიმაღლე მეტია 1.80-ზე

# 4)ახსენით თითოეული ალგორითმის გამოსახვის გზა (flowchart / pseudocode / natural language)

# 5)კომენტარის სახით ახსენით რა არის ალგორითმი და მოიყვანეთ რეალური ცხოვრების 3 მაგალითი

# 6)აუცილებლად უყურეთ ჩანაწერს თავიდან




# Flowchart - ფოტოს მეშვეობით ალგორითმის ასახვა

# Pseudocode - ალგორითმის ასახვა ინგლისურით + პროგრამირების ენით 

# Natural Language - ალგორითმის გამოსახვა ბუნებრივი ენით