# 2)შექმენით რიცხვების სია, სადაც შენახული გექნებათ 10 რიცხვი. Slicing-ის მეშვეობით გამოიტანეთ ამ სიის პირველი ხუთი რიცხვი და გამოიტანეთ ტერმინალში

# num1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# print(num1[0 : 5])

# 3) შექმენით სია, სადაც შეინახავთ რიცხვებს 20-იდან 30-ის ჩათვლით. Slicing-ის გამოყენებით დაბეჭდეთ ამ სიიდან  ყველა ლუწი რიცხვი. (მინიშნება: step)

# number = [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30]

# print(number[::2])

# 4) ცვლადში შეინახეთ სიტყვა "Goal-Oriented Academy".
# გამოიყენეთ Slicing რათა აქედან დაბეჭდოთ მხოლოდ სიტყვა "Academy"

# goa = "Goal-Oriented Academy"

# print(goa[14 : 21])

# 5) კომენტარის სახით ჩამოწერეთ ყველა ჩაშენებული ფუნქცია, რაც აქამდე გავიარეთ Python-ში. შემდეგ კი დაწერეთ თქვენს მიერ ჩამოწერილ ფუნქციებზე თითო-თითო მაგალითი.

# type() - ნახულობს რა ტიპისაა ცვლადი
# str() - სტრინგის ტიპია
# int() - ინტენჯერის ტიპია.
# range() - ქმნის iterable-ს მოცემული დიაპაზონის მიხედვით.
# print() - ბეჭდავს მონაცემს ტერმინალში
# list() - ქმნის list-ს.
# input() - მომხმარებლისგან იღებს მონაცემს.
# float() - კონვერტირდება რიცხვს float ტიპში.
# bool() - აბრუნებს ობიექტის ლოგიკურ მნიშვნელობას.



# 6) კომენტარის სახით ახსენით თუ რა უპირატესობები აქვს ფუნქციების გამოყენებას Python-ში.

# Python-ში ფუნქციები კოდს მარტივს, ორგანიზებულს და მრავალჯერად გამოყენებადს ხდის. 


# 7) გადახედეთ ამ რესურსს:  👍🏼